{"Reviews": [{"Title": "Excellent Laptop", "Author": "Darren He \"in Boston\"", "ReviewID": "R2MEC7FNZ0SZ31", "Overall": "5.0", "Content": "The Thinkpad T series is IBM/Lenovo's standard business laptop, and as a college student, I have found it to be perfect. I have the T60 model with the specs listed above: T2500 (2GHz Core Duo), 1 GB Ram, 100 GB Hard Drive, SuperDrive, Bluetooth, Wireless Internet, Fingerprint Reader, Windows XP SP2, 128 MB ATI Radeon x1400. The laptop is very well constructed and sturdy. The keyboard is excellent, and very responsive. The screen is slightly dim, but I usually use it at an even dimmer setting anyways to conserve battery life. I also have a dock and a 21\" widescreen monitor. Recently, when my computer became infected, I merely used the backup sector (which takes away 20GB from your hard drive) to reload everything - it was a lot easier than manually reformatting, installing Windows, installing the thinkpad drivers, etc. The drivers are also very good, with the exception of the Thinkpad Access Connections, which I uninstalled immediately. The embedded security chip works well, if you need to use that. I prefer to key in a password rather than use a fingerprint reader. The fingerprint reader will not work if there is moisture of your fingertip. It also needs to be recalibrated (i.e. reprogram your fingerprint) every know and then. Since getting a dock though, I've chosen to forego the fingerprint reader completely.I purchased this thinkpad with the accidental damage protection warranty, which means I can do nearly anything to the thinkpad I want, and it will be replaced. Why would I though - it's a great computer.Battery life is pretty good - the 6 cell battery is rated at 3.5 hrs and will give you a decent 2.5. You can always upgrade to a 9 cell battery and/or take out the DVD-burner and stick in an extra battery there.Opening up the T60 is also easy, and allowable under the warranty to some extent - for example, adding RAM or replacing the keyboard (replacement keyboards are shipped overnight!)I also like the matte-ish finish off the laptop cover as well as the screen. All in all, a wonderful laptop, and with a student discount, very affordable. The newer Thinkpads have Core 2 Duo processors (marginal performance increase over the Core Duo in this laptop), and are Vista Ready. You can always upgrade. Highly recommended laptop.", "Date": "December 12, 2006"}, {"Title": "Quality is lower", "Author": "Jdizzle Fo Shizzle", "ReviewID": "R38NLE97C8SCYD", "Overall": "3.0", "Content": "I've used Thinkpads as far back as the 600E.  I travel a lot for work and preferred Thinkpads because of their rock solid performance.  Now that I've recently upgraded from a T41 to a T60, I think Thinkpads have gone down in quality.  Not sure if it has anything to do with IBM selling the business unit to Lenovo (Chinese company).Anyhow, this T60 feels a lot more \"plasticky\" than the T41.  It just seems cheap and flimsy.  I also have a lot of problems docking and undocking this machine.  With the T41, I can undock the machine, run to a conference room, open the laptop and not miss a beat.  The T60 has problems adjusting screen resolutions, recognizing my mouse on the dock, and crashes with the blue screen of death.  I feel pretty frustrated right now...", "Date": "January 31, 2007"}, {"Title": "Great product", "Author": "Joseph Muriuki", "ReviewID": "R3Q22PGZ6VSSFK", "Overall": "4.0", "Content": "I was not sure about the product but as soon as I received it I was impressed. Lenovo ThinkPad works great just like advertised. It surfs the internet great and fast.", "Date": "July 22, 2013"}, {"Title": "Not worth your time.", "Author": "natasha brown", "ReviewID": "R3V2E7BHJDH8ON", "Overall": "1.0", "Content": "This laptop was a rip off. I couldnt understand it at all. I took it to the geek squad to figure out why the dvd player wouldnt work. They even said it was too old for them to work on. Its 6-7 years old. They also said the windows xp was swipped out of the laptop. Within a days use thebattery life lasts for about an hour.I will never buy this product again.", "Date": "January 15, 2014"}, {"Title": "Good Purchase", "Author": "Meta R. James", "ReviewID": "R1H9SP6GN0T6OF", "Overall": "5.0", "Content": "This is a good product.  Delivery was on time.  I purchased another lap and gave this to my nephew who is in college and he loves it.", "Date": "December 9, 2013"}, {"Title": "Good deal on laptop", "Author": "danno101 \"danno101\"", "ReviewID": "R2SLVWTP97ZXDF", "Overall": "4.0", "Content": "I was a little hesitant at first buying a \"used\" or \"refurbished\" laptop. After receiving this unit I must admit it was better than anticipated. The laptop was in very good condition. Over the next two weeks I put it through the wringer testing every feature possible including battery life. I would have posted 5 stars if backup/recovery disc(s)would have been part of the package.Shipping was quick and laptop was adequately packed.", "Date": "May 13, 2012"}, {"Title": "Not for college students", "Author": "WSUcoug", "ReviewID": "R9HHGIRYUI2FJ", "Overall": "3.0", "Content": "I am in search of a laptop for college :) and I heard great reviews on Lenovo, so I purchased one. Turns out, its one of those old computers, that isn't for the modern student, no offence but its great for mom and dad :) but for a gamer/student, yeah not the best product ^^. The company, computerpawn, is fairly decent, although a little disappointed I had to pay for my own shipping, as I returned it.", "Date": "June 19, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Core Duo T2500 / 2 GHz - Centrino Duo\nRAM 1 GB (Memory)\n100 GB Hard Disk Drive\nDVD+RW (R DL) / DVD-RAM - Mobility Radeon X1400\nGigabit Ethernet - WLAN : Bluetooth, 802.11a/b/g", "Name": "Lenovo ThinkPad T60 2623 15-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/415ZLggEpDL._SX300_.jpg", "ProductID": "B000F8EWHY"}}