{"Reviews": [{"Title": "Weak contender", "Author": null, "ReviewID": "R1JNZ3VSVFVEOR", "Overall": "2.0", "Content": "Steer clear from the FRV series from SONY.  Sony makes great products but this is not the one.  Go with the GRT series for any multimedia graphics needs.  I owned this laptop for 12 days and had numerous issues including the DVD-R was DOA.  Pinnacle studio 8 crashed every time.  Benchamrk scores compared this 2.8 p4 to 1.8 p4's .... not good.  On a positive note the LCD is beautifull, great keyboard and design, Nice Sony software package.  This is not a desktop replacement though.  And with the inability to do any multimedia with the limited IGP, it renders the DVD-R useless anyway.", "Date": "November 19, 2003"}, {"Title": "Awesome Perfomance, Heavy, A Desktop Replacement", "Author": "Adam F. Jewell", "ReviewID": "R1ZK2KL0S30545", "Overall": "4.0", "Content": "If you are looking for a portable computer this SONY is simply awesome.  A notebook or laptop it is not; its big and heavy by todays standards but the performance is fantastic!The Gateway desktop died (will never buy from them again) and couldn't be brought back to life so I decided to pick up a \"notebook\".  The FRV37 is blazing fast, the screen is large, bright and clear & its got plenty of HD space (if you need more consider getting an external USB hard drive).  With a CD and a DVD burner you really don't need a desktop machine anymore.  It comes with a nice software bundle.  Its got firewire built in and is great for capturing video from digital video cameras.  If you go on vacation, take this computer, a Sony or Canon Digitial video cam and an Olympus digital camera and everyone on the trip can go home with CDs or DVDs of the trip.Buy this machine if you want to replace your desktop, you don't need long bettery life (it gets about 2 hours max), and you want something portable but not light weight.  The only thing missing is built in wireless but for about $50.00 you can get a wireless card that will do the trick.  This computer has NEVER crashed unlike all previous computers (desktops from Gateway) that crashed frequently.Only 4 stars because its heavy, has short battery life and missing built in wireless.", "Date": "February 4, 2004"}, {"Title": "They don't give you all of the facts", "Author": "\"lucifer_smurf\"", "ReviewID": "RM3DS1D9356FJ", "Overall": "4.0", "Content": "First of all, even though this is a 60 gig drive, you only get 50 g of usable space. Seems they reserved 10g for restoring.  You are supposed to be able to use some dvd-rw to restore it (there is no restore cd included), however, it won't let me. I'm not about to sit down w/ 10+ cd-r's to do this.  They give you lots of software, but nothing that great.  I had been using an old version of Quicken.  The Quicken 2003 that came with it would not let me import the info w/o buying the upgraded version.All in all it's a good package though.  the documentation that comes in the box is more ad's for sony products than actual info on your $1600 investment.  I can't find out the actual dvd burning speed, but it appears that it is only 1x.  booThis barely gets the fourth star.Good, but could have been better.", "Date": "December 24, 2003"}, {"Title": "Good value notebook", "Author": null, "ReviewID": "RWNZKP1W14ET1", "Overall": "4.0", "Content": "I've had this machine just over a week now. So far I like it. I took off one star because it doesn't have built in wireless. I chose this machine because it had the best display of the machines I looked at under $1500.00 (I paid $ 1350.00) at Circuit City. The keyboard and display are both very nice. The sound is not great but it was better than two Toshiba machines I was looking at. It has USB 2.0 and Firewire. It also has an ATI Radeon chip with 64mb of shared RAM. I was able to make restore disks using two DVD-R and one CD-R with no trouble and free up the restore partition on the hard drive. I benchmarked my machine using SiSoft Sandra 2003 and came up with performance expected of a 2.8 Ghz Pentium 4. I should point out that I am technically experienced. I had my own business repairing and upgrading computers. Maybe the process of creating the restore disks is more challenging for others. All in all I think I got good value for my money and would recommend someone looking for a laptop in the $ 1500.00 at least take a look at the Vaio FRV37.", "Date": "January 14, 2004"}, {"Title": "Great product", "Author": "Jaime H \"D1lux\"", "ReviewID": "R3KO4D6L6916BI", "Overall": "4.0", "Content": "I bought this computer recently after I got my old one stolen. As a college student, this computer has proved to be fast and reliable, though the main two reasons why I didn't give it a 5/5 is because:a)It is pretty bulky by today's standardsb)No S-Video port (a must on most of today's computers, but it does have a VGA port so you can still manage to connect it to other audio/video devices).The speakers that the computer include are not that great, but I already had Z-680's so it wasn't a big deal.The graphics on this computer are pretty good, and it has a decent amount of memory. The DVD burner is also a huge +.", "Date": "March 22, 2004"}, {"Title": "Average laptop", "Author": "A. Mahajan \"AM\"", "ReviewID": "R2MVOPGKIJ21PT", "Overall": "3.0", "Content": "I purchased this notebook around 2 years back. Overall the performance is good. As mentioned by other reviewer, the battery life is very poor. You can not do multitasking, the performance becomes slow. I don't like the screen as well. It doesn't have the wide, xbrite screen and you can not watch movies in group.I think I like the most is the the dvd burning capacity. I have copied many dvds without any problem.Overall its OK laptop.", "Date": "January 17, 2006"}, {"Title": "Big, heavy, short battery life", "Author": "N. Barlow", "ReviewID": "R32ED4EJLC8CM1", "Overall": "3.0", "Content": "I bought this laptop 7 months ago, as a desktop replacement, and I quite like it.  But I'm not sure why - it weighs a ton, the battery now lasts less than half an hour, and the DVD burner has a DVD-to-coaster making ratio of less than 50%.But on the plus side it's powerful (I use it for video editing), and the screen and keyboard are both good, and overall it's not bad value, especially if you're lucky enough to get a reliable DVD burner.", "Date": "October 22, 2004"}, {"Title": "So Close", "Author": "M Bizzle", "ReviewID": "R2Y0WR92WDQ3ZL", "Overall": "3.0", "Content": "I wouldn't hesitate giving this model a 5 star rating, were it not for its outrageously loud cooling fan. I swear, the thing is louder than my old E-Machines desktop (from '98!), making use of this computer an almost painful experience. The VAIO suffers from all the usual problems with Windows models - OS crashes, freezes, etc. - but these are not frequent. Damn, I love it's performance, features and appearance, but there's no reason to buy a computer if  using it is as unpleasant as this.", "Date": "May 31, 2006"}, {"Title": "more than satisfactory, but has its problems.", "Author": "George L. Locke \"angry citizen\"", "ReviewID": "R3IAZ6DUNXV5NM", "Overall": "3.0", "Content": "i bought this machine because it was relatively cheap and i wanted something portable with a lot of processing power.  I have never wanted for processing speed, and i can take the thing around places, so my basic needs are satisfied.The problems:A) low battery life.  My battery life is now about 20 minutes.  When i got it, the life was ~1.5 hours.  I'm guessing that this is what happens when you overcharge a battery constantly by having the laptop plugged in all the time.  Apple has solved this problem, why can't sony?B) heavy.  and the ac adapter is HUGE, about the size of a psp/1st gen. gameboy.  Will fit in backpack, but it will weigh you down.  It's fine to carry - so long as its the only thing you're carrying.C) hot.  i highly recommend a centrino processor.  p4s are just too hot for a laptop.  They burn the battery and the computer occasionally shuts off b/c it's too hot.  These problems are endemic to p4 laptops.  Get a centrino.Overall i am satisfied, if not ecstatic.", "Date": "November 30, 2005"}, {"Title": "Recovery Issues", "Author": "Rohit S. Prabhu", "ReviewID": "R2IO6LL42ULNS4", "Overall": "2.0", "Content": "I had a lot of trouble upgrading from XP Home that came bundled with my FRV37 to XP Professional. I had to do a fresh installation of XP Pro that formatted my machine. This also resulted in loosing all of the preloaded software. I just ordered for a set of Recovery DVD's from sony for $35. I fail to understand why Sony wants to save on recovery CDs...Customers beware!!! Do not try updrading the machine to XP Professional. Sony does not support it.", "Date": "February 12, 2004"}, {"Title": "GREAT LAPTOP PITY THE BURNER DOESN'T WORK", "Author": "C. Hubbers", "ReviewID": "RPEWUGQSJO3RA", "Overall": "1.0", "Content": "I rate this laptop highly in all areas except the DVD-RW drive has never worked. I have tried everything including contacting Sony support and nothing works. This problem seems to be a widely known issue with no answer.I would definitely buy another product with another burner in it if you are interested in burning or backing up data to a DVD.", "Date": "February 2, 2005"}, {"Title": "Best Gift", "Author": "Veronica Acevedo", "ReviewID": "R6HZCKTNJ1GCE", "Overall": "4.0", "Content": "I received my VAIO for Valentine's Day and I LOVE IT!!!!  I didn't have a problem with making my own recovery discs. Only drawbacks are battery life, short power cord, and no integrated wireless.  All of which I can deal with.  Just having a product built by a reputable manufacturer is good enough for me.  It has proven to be reliable so far and I would recommend purchasing a VAIO to anyone interested in purchasing a notebook.", "Date": "March 15, 2004"}, {"Title": "Great!!!!!", "Author": null, "ReviewID": "R3CASGWVP2UFMD", "Overall": "5.0", "Content": "A+++++++++++++ item w/ dvd,cd drive, huge hard drive space and ram and i havent had any problem w/ it", "Date": "January 19, 2004"}, {"Title": "sony vaio laptop", "Author": "Jamie Dramis", "ReviewID": "R8QAHNTL89Z9P", "Overall": "3.0", "Content": "i love sony's but downfall this model number was the wrong model number and who ever had this before us didnt read the system requirements cause some one tried to install windows 7 in it numerous times and not reading it cause if the system requirements were read than would of seen not compatible with windows 7 cause it is an older computer and the other down fall is i got this for my man cause it was cheap and good for my budget and come to find out he could only get on the internet once in a great blue moon. had it since 2011 and only been able to get on the internet with it 2 times but it is good for if you like to play games that you install on the computer using a cd as long as it meets the game requirements and to download cd's on it.", "Date": "June 23, 2013"}, {"Title": "DVD-R  not works", "Author": "Juan Pablo Hurtado", "ReviewID": "R18HLM4YM0BYCG", "Overall": "2.0", "Content": "Well, I recently bought the FRV-37 Notebook. It's nice when you want speed, space of hard drive..but when i want to burn DVD's it have a constant WRITE ERROR... I'm from Chile and i dont have garanty here because i bought in USA on my vacation... That's the only wrong thing about this computer... But it's too importante because it's the more expensive part of this laptop..If you know how to repair it please write me at : juanpa_10@hotmail.comThanks a Lot", "Date": "March 13, 2004"}, {"Title": "Hard Drive Failed After 14 days.", "Author": "Steven Nakamura", "ReviewID": "RZPY4806P6ADS", "Overall": "2.0", "Content": "Bought the computer on my trip to Honolulu Hawaii on Oct. 21. On a business trip to Japan, the hard drive failed and could not get it fixed at Sony Dealers in Japan. Was told that must send to San Diego, CA to get fixed. Recent quotation is $700 plus. Never buy Sony made in China. Will never buy Sony...period.", "Date": "November 4, 2003"}, {"Title": "Yep, no recovery DVD's and no way to make", "Author": "tbaker", "ReviewID": "R12HHD5HHCYKXV", "Overall": "3.0", "Content": "I've had my SONY VAIO FRV37 for 2 days, and it is going back.  I keep getting  a write error  when making recovery DVD's, ruined 4 of them already.  They were going to suggest I do the 10 CD method but before it was out of the mouth, I said nope.  Then they wanted to send me recovery DVDs for free, but why does the DVD writer keep having a write-error from the get go.  Reminds me of a Toshiba I once owned that I could not make recovery work after making floppies for recovery (24 of THEM!) that was junk from Day 1 and eventually had a class action suit against them that Toshiba lost, but the settlement was puny considering the grief that thing gave me.  Now, Sony has to go back.  CSR said he would take it back rather than take the free recovery DVDs, too.  That's good enough for me.  Do I give them another chance, or do I buy something else?", "Date": "February 13, 2004"}, {"Title": "Bad Hardisk, bad keyboard, bad battery", "Author": "Tran Son", "ReviewID": "R1ZDSN4O7SJ9VW", "Overall": "1.0", "Content": "I bought this laptop about 2 years. But after 2 years my dardisk, keyboard and battery was damaged. I ask the support but dont have anything. Very very :-((((((", "Date": "September 21, 2005"}, {"Title": "One of the best BUT", "Author": "Iyad Muhanna \"iyad muhanna\"", "ReviewID": "R5F9X9K0EPMPO", "Overall": "4.0", "Content": "Ok, I just got a new VAIO PCG-FRV37 and it has been great in every aspect but I dont understand why Sony doesnt include a backup recovery CD along with the computer. I never knew until I actually bought one, if i did, i would have never bought a Sony. Oh, I will never buy a Sony ever again. The fact that they want to sell me a recovery CD for a laptop I paid $1500 for pisses me off. Anyhow, great machine but not so great company.", "Date": "January 12, 2004"}, {"Title": "excellent!", "Author": null, "ReviewID": "R2JVDV8XX8KPFT", "Overall": "5.0", "Content": "Great computer!", "Date": "April 7, 2004"}, {"Title": "this is a ecxellent laptop very fast works good", "Author": null, "ReviewID": "R3A5ATWW9VVXZU", "Overall": "5.0", "Content": "this is a ecxellent laptop very fast works good", "Date": "November 16, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.80-GHz Pentium 4\n512 MB RAM (Memory)\n60 GB Hard Drive\nDVD-RW/CD-RW Drive", "Name": "Sony VAIO PCG-FRV37 Laptop (2.80-GHz Pentium 4, 512 MB RAM, 60 GB Hard Drive, DVD-RW/CD-RW Drive)", "ImgURL": "http://ecx.images-amazon.com/images/I/51XSZ4VJQVL._SX300_.jpg", "ProductID": "B0000DHQ23"}}