{"Reviews": [{"Title": "A Great Apple Ibook for school, Work, Videos Etc.", "Author": "miami heat", "ReviewID": "R3TMUYSHHSIXCO", "Overall": "5.0", "Content": "This used Ibook is great. This is a quality product from apple. The laptop is smooth and fast.  I was able to preform Many different tasks at one time. A great laptop for school and anything els for under $250.00. Thank you Apple. DR Bargains Is a great seller.", "Date": "July 17, 2012"}, {"Title": "Excellent Experience", "Author": "G. Sullivan \"Alabama Handicapper\"", "ReviewID": "R96T96OQZ5EVU", "Overall": "5.0", "Content": "The people at Pacificmacs did an excellent job of resolving an issue with the computer after I received it. They stand behind what they sell.I recommend them without reservations.", "Date": "April 23, 2012"}, {"Title": "I Just Don't Understand!!!", "Author": "Bailey052095", "ReviewID": "R11G2EL74TZT8F", "Overall": "5.0", "Content": "I order a 14\" Ibook, and i am stunned! This Ibook may be considered out dated...BUT is really great for every day use! Sure you may need to set up for your first Internet's  use... but when every thing is all done and put in it is well worth it! I used to be a windows person, but now that i found what i have been missing for rek. time, it feels fun to be on a computer again. AND to top things off most of the service i have been receiving on this product is AMAZING! I ran into a bump with the product its self(battery was no good)i am currently working on getting one...is on the way not at my expense... This is a must have laptop at the price along with uses... This lap top comes with the software you need... you don't need any other software... because its everything you need. I was really hoping this thing wouldn't replace my windows and something to give to my older brother for school. but this devise belly's up to the bar, now i just want to throw away that windows 7. it my be a down grade of software, it is smooth it is speedy.  The product its self comes neatly packed, BEAUTIFUL and clean... devise which i expected had some usage on it but grate. i really appreciate the seller: Narby-Ken I am in-pressed. JUST SO EVERYBODY knows i am not being paid for this review.  This Review was made on a Apple Ibook G4!  Great devise!", "Date": "July 23, 2012"}, {"Title": "Runs Great in spite of the fact that it did not include all the software as advertised.", "Author": "Rich F", "ReviewID": "R1D62ARX5Q1LOU", "Overall": "5.0", "Content": "Besides the fact that the iBook did not come with the Classic Environment installed as advertised, it has run flawlessly for three months.I love the keyboard, it works perfectly with a two button mouse and scrollbutton, and it does a bootable backup to a Firewire external drive using Silverkeeper.Tiger is a very nimble operating system and runs in 1/3 the ram as my iMac and actually surfs the web faster than my iMac.It's a great little compact computer.", "Date": "February 6, 2013"}, {"Title": "In short, I love it", "Author": "Michelle Chariste", "ReviewID": "R3THZXE1XP2YN3", "Overall": "5.0", "Content": "This isn't the perfect laptop. I know it and it's my first one. There are many this it can't do, so make sure you know the details before buying it. But i find that it is perfect for my needs. I has Microsoft office, I can watch youtube, movies (with the dvd) surf the web and the seller even had final cut pro which was a bonus.Recommendation for future owners:Consider updating to mac OS 10.5 and up (preferably work it out with your seller) Mine came with 10.4.11 which works, but a lot of software I've tried to download require 10.5.3 or so and up which gets frustrating. Thankfully Sims 2 works with even lower software than 10.4 which was something short of a miracle but do your research when looking for games and other software", "Date": "July 6, 2013"}, {"Title": "I feel a bit ripped off - but really my fault for not doing more research.", "Author": "bikertrashice \"Ice\"", "ReviewID": "R3539H4JSCV55P", "Overall": "3.0", "Content": "I cannot upgrade the operating system - Apple doesn't support this model for more upgrades so some limits to its use.  For example we cannot watch youtube because it requires an Abode upgrade that can't be loaded because the operating system won't allow the Abode upgrade and I can't upgrade the operating system - a Catch22.  Well - I guess my fault for not researching this before I purchased but I never would have thought that Apple and Adobe would pull this kind of nonsense.", "Date": "May 23, 2013"}, {"Title": "Great computer for the money and especially for seniors", "Author": "Joseph M. Seda", "ReviewID": "R2YJTBEQ46WKTU", "Overall": "5.0", "Content": "Works well enough to be almost competitive for my 2 GB, dual core 3GHz, Win XP desktop. I was surprised it worked well even with only the 512 MB on board memory. With a full Gig it runs quite well, on office programs, internet browsing, and even viewing YouTube videos. The battery still works several hours on a charge, unusual for a used computer. Also it came with OS 10.5 instead of the 10.4. A Mac of his type is perfect for seniors without technical backgrounds. Easy to learn and use. A really good buy for the casual user. Only handicap is the limited 3rd party software available, however apple applications do have good reputations. Actually the only thing missing to make it a perfect computer is MS office.", "Date": "November 11, 2013"}, {"Title": "Great computer", "Author": "Jeffrey", "ReviewID": "R3MCXD95D2V7MG", "Overall": "5.0", "Content": "The computer is in great shape like the seller said it was a great price for what the price was the battery doesn't stay charged without the charger but it still was a good price.Thank you", "Date": "January 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "512 MB of RAM ; 60 GB internal drive ; internal SuperDrive\ninternal 56k modem ; Airport Extreme and Bluetooth installed ; 14\" display\nCertified Pre-Owned Mac with 90 day warranty ; OS CD is not included\nOS 10.4.11 installed ; Classic Installed\nUsed Mac with 90 day PowerMax warranty", "Name": "Used iBook G4/1.42 GHz, 512 MB of RAM, 60 GB internal drive, internal SuperDrive, internal 56k modem, Airport Extreme and Bluetooth installed, 14\" display, Certified Pre-Owned Mac with 90 day warranty, OS CD is not included, OS 10.4.11 installed, Classic Installed", "ImgURL": "http://ecx.images-amazon.com/images/I/514El-QeCsL._SX300_.jpg", "ProductID": "B000PQFZ40"}}