{"Reviews": [{"Title": "Love my XPS M1710 :D", "Author": "Christian Erekson", "ReviewID": "R2CHZMLICX675E", "Overall": "5.0", "Content": "This is such a great and well made gaming laptop ! It arrived well packaged and it looked like it came right off the assembly line from dell :)Pros :*Build Quality**Design**Upgradable Parts**Still plays majority of today's demanding games, Crysis, WIC, WRC 2010, UT3 etc**16 customizable led lights**Powerful**Not Heavy*Cons:NONE :D :D :D :DWell if your looking for a good gaming laptop, but want one that's of quality and isn't the most powerful, then don't hesitate to get one !", "Date": "July 5, 2013"}, {"Title": "Awesome Laptop", "Author": "SClark", "ReviewID": "R2BERILAEZ6A0S", "Overall": "5.0", "Content": "I purchased one of these back in 2007 and it is still running strong.  Yes there is a video card issue with them.  They need to be on flat free from debris, table clothes, and other stuff that will limit air flow.  I have only had to bake my video card once and replaced the thermal pads on the CPU and GPU with artic silver with no further issues.  Also get the I8K GUI software to control your fans and monitor your CPU and GPU so you know when it is time to service it yourself.  This laptop is highly serviceable and the documentation has always been available from Dell.  The only downside is that you do need to clean it and replace the thermal paste periodically due to the amount of heat that is created from running this powerhouse.  I recommend replacing the hard drive with a Solid state unit since it is blazing fast then and extends the battery time to something realistic.  The standard battery time while gaming is only 45 min due to the awesome graphics and processing.", "Date": "January 5, 2013"}, {"Title": "Great machine from a not so great company", "Author": "Daiho", "ReviewID": "R2CIU0TH6E3T9H", "Overall": "4.0", "Content": "I bought this computer from Dell in 2007.  At the time it was one of the most powerful laptops available and retailed for approximately US$3000.  I have carried it across the world and used it in Japan, Nepal, India, Thailand, the US, and now in the Middle East.  I am still using it today.Like hundreds of others, mine suffered from the poorly installed graphics card, but fortunately this didn't cause serious trouble until this year, when I had to have the card remounted.  Dell does not provide this service and will not tell you how to do this.  Nor will they sell you a reasonably priced replacement graphics card, as they are keeping what they have for computers still under warranty.The only other problem I've had is the loss of both power sources.  Batteries quite naturally have a short shelf life, but I've never had a AC power source burn out on any appliance I've ever owned.  Only on this Dell.  And getting a replacement was a bit of a hassle as this machine uses a bit more current than your average computer.Otherwise, this has been a wonderful machine.  On balance, it has provided far more hours of productivity and entertainment than it has hours of frustration.#", "Date": "November 24, 2011"}, {"Title": "Dependable and fast - still holds up today.", "Author": "R. Escobedo \"RAEB\"", "ReviewID": "R2G0DKBHX28NED", "Overall": "5.0", "Content": "I was given this computer to replace a constantly-overheating Dell XPS generation 1 since it was still under warranty with Dell.  They had fantastic customer service and took care of me no problem after some security questions were asked.  This one arrived and it was fantastic from the beginning.  It still has served me well though the military, medical school and graduate school, as well as being a pretty high end gamin machine.  It does relatively well even today, though for gaming it is now underpowered; for anything else it is still great.  This laptop is one of the best and most reliable; I've updated it to windows 7 x64 and the RAM to a full 4G to keep it as current as possible.This is a great machine and I will gladly buy from Dell again - in fact I'll probably stick to high-ends and get an alienware from them in the next year or two.", "Date": "January 16, 2011"}, {"Title": "Dell's Poor Customer Service and Poor Accountibility", "Author": "Christophe J. Houseman", "ReviewID": "RI3FIY3PUY5QG", "Overall": "1.0", "Content": "I had really enjoyed my Dell XPS M1730.  One day the LCD panel started having problems.  I contacted Dell Technical Support via chat.  They had me run a series of lengthy diagnostics.  These diagnostics did not find any problems.  The problems with the LCD panel continued.  I contacted Dell Technical Support via chat again.  After 3 seperate lengthy chats they authorized that the display adapter be replaced.In a few days a contracted service technician (authorized by Dell) came to my home and replaced the display adapter.  This did not alleviate the problems with the LCD panel.  After the technician performed the service on the computer the FN key on the keyboard ceased to function.  I contacted Dell Technical Support via chat once again.  They authorized the same technician to replace the keyboard on one visit and he replaced the LCD panel on a 3rd visit.Replacing the LCD panel resolved the specific issues I was experiencing with the LCD, however the new LCD panel had a number of new issues.  The original LCD panel which came with the computer was a Sharp. This Sharp LCD panel had no issues until about 10 months after I had purchased the computer.  The LCD panel which was installed to replace the Sharp is an LG.  This LG LCD panel has very bad backlight bleeding, extremely slow response time and a purple blemish in the bottom left corner.  These issues make the computer unbearable to use.  The original Sharp LCD panel did not experience any of these issues.I contacted Dell Techical Support via chat once again.  They had me send it to the Dell Depot in Houston, Texas.  The chat technician verified that the LCD would be replaced with a Sharp LCD panel that did not experience these issues and be free of defects.  I sent the computer to the Dell Depot using the box that Dell had shipped to me.  Included in the box was a sheet of paper which listed an area to describe the problems with the computer.  I listed the problems in great detail, including the problems with the LCD display.When I received the computer back none of the issues I detailed had been addressed.  The LCD panel had not been replaced.  Only now the computer would not boot from the hard drive.  Something had happened while the computer was at the Dell Depot which caused the BIOS to not recognize that a hard drive was installed.  Now I could not use the computer.Since the computer is not functional I am not able to work.  This is a computer I use for work.  I have and will continue to lose a great amount of productivity due to this problem.I contacted Dell Technical Support via phone and explained to them what has happened.  I spoke with a first level technician and his supervisor.  The only things they said they would do is send out another technician to replace the LCD, motherboard and hard drive.  None of these items would need to be replaced if the LCD was replaced at the Dell Depot like it should have been and if it did not get damaged at the Dell Depot.All Dell is doing is stating that they will do something in the future which should have already been done.  They are not taking any responsibility for the problems they have caused me by not fixing the computer correctly the first time, or the second, or the third...etc.  They did not even state that they would send out the correct LCD panel, so they may still install an inferior LCD panel to the one which was originally installed.", "Date": "September 6, 2008"}, {"Title": "XPS M1710 laptop", "Author": "V for vendetta", "ReviewID": "RXMI5NC1ZMA2A", "Overall": "1.0", "Content": "The XPS M1710 laptop that I received on Amazon had a virus in the motherboard. The seller sent me a batter that was not recognized by the computer bios and could not be used. The bottom of the computer was missing a rubber foot which makes the laptop wobbly.", "Date": "January 28, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000OGVWCU"}}