{"Reviews": [{"Title": "It's almost perfect - after a few tweaks.", "Author": "ScOObydoo", "ReviewID": "R23TK6K6C7HSNU", "Overall": "4.0", "Content": "Let me start by saying that out of the box this product would never receive 4 stars. This is why; Vista on 1Gb of ram just won't do.Samsung have clearly listened to some complaints as my unit did not come with McAfee installed, in fact that amount of bloatware was very limited. Upon booting the device installs itself, then needs an hour to create a backup on its drive. Which is annoying because it places it on a hidden partition swallowing up 13Gb of storage (of your 60Gb).The touch settings in Vista are pretty bad by default, so you really need to tweak those a lot to get them right (turn off the silly mouse \"help\" pointer, enable the keyboard instead of handwriting recognition etc...).After that you need to do something mean to it; rip it open and swap out the 1Gb module for a 2Gb one. It's not for everyone but there are some very handy video tutorials online. All you need is a small screwdriver and steady hands. The 2Gb module (2Gb DDR2 notebook memory) cost me $49. With 2Gb you'll notice a MASSIVE increase in speed. Applications now run smoothly, open fast and there is little to no disk memory swapping. But like I said; it's not a question of an easy to open panel, you need to remove the entire backside of the machine to reach the ram. Why Samsung don't just deliver it with 2Gb is beyond me.Once you have upgraded the ram and tweaked the OS you need to turn off the Vista indexing service (google it), this reduces the amount of drive accesses for indexing your files. All that does is help with file searches which you probably rarely do anyway.Now with 2Gb, better tweaks and some services turned off you'll want to turn off the Vista Aero settings (once again; google it).It's taken you 2 hours, but now you have a PERFECT speedy little UMPC that runs nice and fast.Some general observations:The mouse pointer is beyond useless. It has little to no acceleration, use the stylus and keep the mouse in joystick mode, it'll make scrolling much easier.The \"dialpad\" popup keyboard is horrendous, ignore it and never touch it again.The keyboard on the device itself is for emergencies only. Because that is about the only time you'll put yourself through the agony of typing something on it. The best and (in my opinion) fastest way to type is with the on screen keyboard, or the (optional) Samsung portable keyboard (or any small keyboard of your choice). The Samsung is listed for $89, but comes with a built in eraserhead mouse. Amazon has a folding Bluetooth keyboard for $29 which is a great option for this machine.Audio is impressive, nice and loud.Wifi is great, it connects much faster than my Dell XPS notebook and never drops a signal.The device boots in under a minute and wakes from sleep in around 12 seconds (including connecting to wifi).The screen is perfect; great resolution and extremely bright and sharp.Heat is an issue. It DOES get warm, but never to the point where it will burn you or that it becomes too hot to handle.The Microsoft Origami interface is awesome. Anyone that has seen Media Center will recognize the look and feel. It's a media center/application launcher optimized for touch screens.Bluetooth is stable, they use the Widcomm Bluetooth stack (which put simply means they use a third party company for the Bluetooth software and not the limited Microsoft package).The package is a little limited. You get the unit, a charger, a battery, a wrist strap (that also works as a handle, very clever) and a cheap (poor quality) case. In my opinion Samsung should have delivered it with the organizer case and a keyboard, but I fully understand they wanted to keep costs low on it.All in all it's a winner. I picked it over the competition (Sony UX380 or the OQO model II) because of the screen and the fact that I can upgrade the Ram. The Sony is limited to 1Gb no matter what you do, and the OQO is underpowered with a VIA cpu. Even though this device is only 800MHz I felt that it ran faster than the OQO model II I tested.  It also has the perfect screen size to resolution ratio. The Sony has a higher resolution screen, but is 2 inches smaller making it near impossible to work on for longer durations.My only real annoyance with Samsung is the model numbering on the Q1 ultra series. First of all; calling it Q1 was plain stupid. The previous model was also called Q1, and it's nothing like this machine, so google searches for \"q1 ultra\" return 100's of hits on \"q1 ultra portable\" which is usually NOT this device. Note to Samsung; next time, call it Q2.Then the various models of the Q1 Ultra; they make one with no Bluetooth or cameras, one with Vista, 2 cameras and Bluetooth but no fingerprint scanner, one with XP, 2 cameras, Bluetooth and a fingerprint scanner and several others. All with cryptic names. Bad move. It's near impossible to determine what the exact specifications are of this machine.All in all I can highly recommend the Samsung Q1 Ultra for people shopping for an ultra portable PC. If you use Skype, Office, Internet Explorer/Firefox, Mail and most other basic applications you will be very happy (once again; only on 2Gb). It won't do well on heavy applications like video editing or graphic designs.", "Date": "December 26, 2007"}, {"Title": "Love it", "Author": "P. Knopf", "ReviewID": "R2T30WI9TRF5DD", "Overall": "4.0", "Content": "I own a dual core laptop with 2 gigs ram and a fast hardrive and was looking for something to take notes one, a small tabletthat was small enough to carry in my laptop bag with my laptop, but large enough to take notes on.So far this device has exceeded my expectations.I have taken notes on it for 2 days now with MSFT's onenote loaded.The machine keeps up with my writing.I loaded all of MSFT office enterprise edition on it for the fun of it and Lotus notes 7 for my corp email.I am trying the new windows live mail instead of using outlook for my personal email. I love this as well as I can read my personal outlook emails on the device and my personal gmails at once without them being deleted so my regular laptop still has a full email record.I am starting to use the MSFT Origami interface that comes with it, and so far I like the interface for playing music.The device only has 1 gig of ram, but I have open and am using onenote, windows live mail, lotus notes, a few browser windows, word  and am playing music on it with only the most occasional music stutter.... with the Vista OS.It launches applications slowly once you have consumed the ram and the hard drive isn't all that fast ... but once launched it swaps between applications fine.(+- 11 sec to load excel as opposed to +- 4 sec on my fast LT)Remember I only bought this to take electronic notes on .....  but I may even leave my laptop at home next trip.I am buying the larger 6 cell battery (I think it should have come with this already for the price) but I got over +- 3.5 hours with wireless on and connected with the std battery.  I hope I will be able to have Samsung upgrade this later and add a  cellular chip in this model  but I doubt they will do that....  If you need cellular, I'd say wait.So what don't I like,Some usability nits with the key positioning, a tad more spacing would be better, rubberized keys perhaps and the most popular extra keys positioned on the outside (like the esc key).Of course I'd love a faster CPU, more ram and a faster hard drive, but I'll always say this ......This device is usable as it is, when a faster one comes out I may chuck my laptop away for good.", "Date": "July 26, 2007"}, {"Title": "Wow! This thing is Awsome.", "Author": "PickleDude", "ReviewID": "R18OHMU9FV4SSQ", "Overall": "5.0", "Content": "This computer blows people away. I have had this thing for about a month now and am still drooling over it. Everywhere I whip this badboy out people are fascinated with it. I usually hear a comment about the screen first. People usually say,\" Is that high def or something?\" Anayways the screen is definitely bright and crisp. This computer is a total desktop/laptop replacement unless your into advanced gaming. Oh well that's what the xbox360,PS3, and Wii are for. Yeah you might have to wait a couple seconds longer to load an application and the keys are a little close together, but who really cares? I use the stylus for just about everything and this computer can do everything yours does or more! The 7 inch bright 1024 by 600 native resolution is absolutely perfect. I highly recommend this to anyone looking to buy a computer regardless of desktop,laptop etc. especially college students or anybody that likes to take notes, doodle, and journal. Seriously though, its a little trade off to wait a couple of seconds more to have the sleek, James Blondish super cool head turning mobile PC that this sexy monster is. ENJOY!  This review was written on this computer using mainly the stylus. :)", "Date": "July 31, 2007"}, {"Title": "Fabulous Machine!", "Author": "Ronald M. Cordes \"Watch Looker\"", "ReviewID": "R3CWKQI7PD0T7D", "Overall": "5.0", "Content": "I purchased the Q1 Ultra NP-Q1UA000 with Windows XP installed.  (I read so many other reviews suggesting that Vista was too taxing on the processor and 1 GB of memory).  The bottom line is:  This is everything I expected it to be and more!  I did order the portfolio/keyboard combo but it is still on backorder.  Nevertheless, the variety of input methods (stylus, on-screen keyboard, dial keys and split Qwerty buttons) work extremely well for me.  I bought this machine for two purposes: to check email on the road and to provide a compact way of taking notes during the many work meetings I attend. Its internet capability using Wi-Fi is as smooth as silk and the note taking via Windows Journal and One Note is really neat after you get the hang of it.  The screen resolution is really nice and its readability is enhanced by the brightness settings using the sensitive touch buttons at the top.  Samsung thought of most every niche including a slot for MMC and SD cards--a feature that allows me to share camera shots without hogging hard disk space.  With Windows XP, in lieu of Vista, only 16 of the 60 GB hard drive is used...and that includes the full suite of Microsoft Office 2003 and several other larger programs.  I've read a number of critical reviews about this UMPC but for me, this little jewel is A-1.  Negative things?  OK, the split Qwerty buttons are small, but the on-screen keyboad (and the USB keyboard on order) suppresses that frustration.  The other dislike is that the extended life battery is thicker so that the machine slants to one side when set on a flat surface and I doubt if it will fit too well in the portfolio I have on backorder.  I did order the external USB ODD with the machine and I would highly recommend this to anyone who buys one.  On the other hand, almost any external USB driven DVD/RW will work.  Overall, I am very very happy with this computer.", "Date": "September 4, 2007"}, {"Title": "Nice but flawed.", "Author": "John G. Bennett \"Tanj\"", "ReviewID": "R3528NOHA4WC0K", "Overall": "3.0", "Content": "First and foremost, it works and works well.  Both with the original 60GB disk (I used a 4GB \"EP\" SD chip for ReadyBoost) and with a SanDisk SSD I fitted (look up Hugo Ortega for how) it works at nice speed.  The screen is clear and bright, you need good eyesight of course.The flaws:- WiFi range mediocre.  At home it failed to work in a room where several other devices worked fine.  Set up the WiFi in a place where signal is known strong otherwise you will go nuts trying to juggle the mystery messages in the setup screens.- the mouse thingy at the left is virtually unusable.  Last resort.  It is a joystick but it either zooms or crawls, does not seem to have much dynamic range.  Fortunately you can use the cursor or a fingernail.- the screen does NOT allow you to rest your hand on it, the sensor will not be able to figure out the stylus.  This makes handwriting a bit awkward since you need to rest your hand somewhere and almost everything has some kind of button or sensor on it.  Portrait-right mode is the best for right-handed since the lower edge is clear of gadgets.- the split keyboard is not very good.  Not because it is split, but because the buttons are just too easily mistaken and also the choice of what is on the buttons is awkward.  It works, but not any faster than stylus onscreen.  For logins if you have a \"strong\" password you will go nuts trying to get your password right.- THE THUMB READER IS MISSING.  Despite it being in all the images on Amazon, the model they ship does not have the reader.  And I still have not been able to figure out if Samsung will agree to sell it separately.- the velour sleeve supplied has effectively no protection.  You will want something to carry this safely.Battery life seems good, there seems to be minimal crapware installed, in many ways this is a good experience.  But there could be definite improvements.  Handwriting recognition is fast and accurate.  It is a bit large to be a pocket machine but is quite unobtrusive in a bag.  It is big enough to show email, documents, and web quite clearly.", "Date": "February 21, 2008"}, {"Title": "Nice away from home companion pc", "Author": "M. Dawson \"gadget geek\"", "ReviewID": "R3ORRXEITD706X", "Overall": "4.0", "Content": "I bought this item as something to tie me over until the Raon Everun was released, but Ill be hard pressed to give it up. Video and internet browsing is as good as it gets except id love to be able to insert my sim card and browse away at hsdpa speeds. The keyboard is a bonus, great for short emails and passwords. Recommended for sureNote some of the 60gb drive is usable due to vista backup, there are umpc sites that will show you have to fix this plus to turn off some of the vista features to make it quicker", "Date": "September 2, 2007"}, {"Title": "great but only with xp", "Author": "kev6677 \"TECHNO JUNKIE\"", "ReviewID": "R3BKKD3QU5EBVB", "Overall": "4.0", "Content": "this unit is very slow with the current version of vista installed on it choppy video and long waits for simple task instead if you install windows xp  you would notice a 200% increase in speed and performance watch this baby fly ... for the price i paid 750.00 from amazon i would have given it 5 stars if it had a better keyboard and came with xp installed", "Date": "April 4, 2008"}, {"Title": "it was good device, 5 years ago", "Author": "freakna", "ReviewID": "R1JWT9684IY4L5", "Overall": "5.0", "Content": "i did love it, a lot but that was years ago. now it cant keep up with anything. every partof it is obsoulete. cant even check emails no more. remeber when your looking at reviews. check the date. i finally retired my Q1.", "Date": "November 16, 2013"}, {"Title": "crap", "Author": "J. Chavez \"tibuix\"", "ReviewID": "R2HJVR64FUTN4J", "Overall": "1.0", "Content": "Nice and small. Expensive for the service. After 2 or 3 months is working bad. Hardware buttons do not respond most of the time.Should have a faster procesor and more ram than 1gb. Should not sell it for WVista with that hardware limitations.Origami is useless.", "Date": "April 28, 2009"}, {"Title": "Nifty gadget, but....", "Author": "Erebus Ong", "ReviewID": "R16U6PK0UVOBZT", "Overall": "4.0", "Content": "Pretty good size gadget even for Asian hands. Feels firm and solid for prolong usage. Heat dissipated is generally acceptable.But Vista is definitely not suitable to run on this kind of machine. Recommended to upgrade to 2GB RAM with XP and the machine is almost perfect. Can't expect blazing fast processing and speed as this is running on a low voltage processor.Overall a pretty good second machine for web, simple games and office applications.", "Date": "May 14, 2008"}, {"Title": "Too many corners cut..", "Author": "Stephen P. George", "ReviewID": "RI5I8K9KZ0FTI", "Overall": "3.0", "Content": "This system does not run well out of the box. You will need to upgrade the memory to 2gb and replace the atheros wifi module. The cheap wifi module causes the system to constantly pause (for up to 10 seconds!). It's a driver issue for sure but none the less, it's annoying. After these changes I still wasn't happy with the performance so I switched to xp tablet PC edition OS. Now my Q1u-v runs ok. I've come to not expect much in the performance department of these little PC but they should be able to at least play video files without annoying pauses. Bottom line, if your one who like to tool around with your devices to make them work properly, this is the device for you. If you someone who is not technically oriented, look elsewhere.", "Date": "April 25, 2008"}, {"Title": "Q1 Ultra - an innovative UMPC", "Author": "Joseph Kim \"DrJosephKim\"", "ReviewID": "R3019Q5UMM5UK0", "Overall": "4.0", "Content": "I've tested various UMPCs, and this one is very innovative and fits my needs quite well. The keyboard is small like many say, but you can get used to it (as long as you don't have really large hands). The screen is touch only (no active digitizer), so you'll run into significant vectoring issues. The processor is slow, but in return you get excellent battery life. So, as long as you're not looking for the performance of a dual-core processor, you'll be able to run your basic office applications and stay productive with extended use times. Finally, the best part of this unit is that it stays relatively cool in your hands compared to many other UMPCs I've tested. I would recommend upgrading it to 2 GB of RAM and running XP instead of Vista.", "Date": "March 18, 2008"}, {"Title": "Samsung Q1 U-V AWESOME!!", "Author": "C. F. Rigby \"freebird2nd\"", "ReviewID": "R1NVTRK2PU29CN", "Overall": "5.0", "Content": "I love this little machine.  The screen resolution is fabulous, crisp and clear.  Works great with windows Vista.  I did order the USB Keyboard though, as I do miss one, but really like the split keyboard on the frame as well as using it as a tablet and the handwriting recognition is great.I really recommend this product.", "Date": "September 4, 2007"}, {"Title": "I can't believe I bought this thing.", "Author": "Roy1138", "ReviewID": "R1MK6NO8ETKMH", "Overall": "1.0", "Content": "Just don't waste your money. It doesn't work. Overheats with Windows Seven; crashes with Windows 8. Not worth the effort to upgrade.", "Date": "March 11, 2014"}, {"Title": ":/", "Author": "Juan", "ReviewID": "RUZPE27YMEDO8", "Overall": "3.0", "Content": "it's ok for being a umpc released a long time ago, but very slow processor and graphics are terrible. :/", "Date": "May 25, 2013"}, {"Title": "Cool Little PC", "Author": "subsider34", "ReviewID": "R3T61B816OVALD", "Overall": "5.0", "Content": "Though it only has 1 GB of RAM and an 800 MHz processor, this little machine can run Windows Vista quite well.", "Date": "June 29, 2008"}, {"Title": "great design", "Author": "Andreas Epstein", "ReviewID": "R2R0QDDYE2KA1O", "Overall": "3.0", "Content": "EDIT: 4 stars (3 was a typo) not 5 because it sometimes is too sluggish and the interface could still be slightly improved.Why did i get the Q1U? Because I wanted a good compromise between screen quality and portability in a windows device. What for? believe it or not: to be able to run a 3D CAD program (namely DesignCAD). Not realy in order to do the main drawings there, but in order to have them available, be able to look at them when on the go and eventually even create a small item in order to evaluate it. I really was not sure if this would work when i got it...but at $750 for the qiuv i took the risk. I did an upgrade to 2GB and i must say: I AM AMAZED. not only does the design program work perfectly fine (of course not as smooth as on my desktop, but it really does work, including rendering shaded objects and moving them around). Now, with this design program (and many other programs too) it is helpful to have keys available in order to enter commands. the keys around the screen are doing a great job here. And the fact that you have a tablet pc in a slate shape and still access to hardware keys is really extremely convenient and you find yourself sitting in a coffee shop surfing the web with a little something in your hand. This device really has been designed with the end user in mind. It definitely changes the way one uses a pc when on the go. I do agree that for longer texts i would use an external keyboard, but being used to the thumb keyboards from my pocket pcs i learned typing blindly on the keyboard rather fast and i use it for chatting and emailing on a daily basis. the qiuv has become my daily companion and i simply love it.", "Date": "June 11, 2008"}, {"Title": "Compact but Slooow", "Author": "W. Tobias", "ReviewID": "R3KFBJYAKUVGJF", "Overall": "4.0", "Content": "This basically does what I want--with the optional keyboard and case, requires little space and weight in a suitcase when those are at a premium--major drawbacks are processor speed, battery life (maybe half an hour based on settings), and limited wireless distance.  Otherwise great machine.", "Date": "April 20, 2008"}, {"Title": "Great PDA", "Author": "roaeja \"Hey you!\"", "ReviewID": "R2GDG90BYOSP42", "Overall": "4.0", "Content": "Got tired of hung and peck typing on screen input.  Other than than, nice PDA. Never couldfigure out how to get webcam to work. I would recommend the EeePC over this.  At leastit has a keyboard and cost only $399.", "Date": "April 9, 2008"}, {"Title": "Not Bad for a Blind Buy", "Author": "Philip", "ReviewID": "R2WAKO98WCJMCZ", "Overall": "4.0", "Content": "I bought this refurbished and I must say it was better than I thought. it didn't come with a stylus (they did say that)[EDIT]{It did come with one it's in a slot at the bottom} second the cover that protects the vga, usb and lan cable wasn't included (not mentioned). For the most part it's not bad this device can play games like a computer (stand alone games and emulators worked pretty well) I used it so far to play VERY old pc games and so far so good. I recomend buying one in much better condition than mine but even mine isn't bad.", "Date": "June 19, 2013"}, {"Title": "Very difficult to use", "Author": "Anne Bird \"Annie\"", "ReviewID": "R2FD8IHEMS5UBX", "Overall": "1.0", "Content": "First I had to buy a DVD drive to install Office 2003.  I should have been able to do that from my laptop drive.  Some of the program downloaded ok such as Outlook messages but not my contacts, calendar or notes.Excel seemed to work ok but Word documents were garbage.The writing started out ok but now it just stalls and I have to resort to the keyboard on the screen.  Still have not figured out the buttons, i.e. shifting to symbols instead of letters.It stalls a lot and I have to take the battery off and put it back on frequently.  I would think that for $1,000, it would work a whole lot better.", "Date": "September 4, 2007"}, {"Title": "Just say no!", "Author": "Wine Guy", "ReviewID": "RAVZN2WR9P5KX", "Overall": "1.0", "Content": "We bought this to manage pictures and email while travelling.Pro: It's a full Windows Vista computer small enough to carry in a large coat pocket.  OK battery life.  Good gadget factor. It will pass airport security while in your bag.Con: Very slow.  Too small to be substitute for a full sized computer.  The \"keyboard\" is a joke.  Without a hard cover the screen is in constant jeopardy of damage.Overall this was far more frustration than it was worth.  Returned it to Amazon.  Next time we will take a laptop.", "Date": "December 11, 2007"}, {"Title": "Awful", "Author": "Francisco D. P. Britto", "ReviewID": "R8QZ4UMCWTXZF", "Overall": "1.0", "Content": "The touch screen stops working in a week, i found many people with the same problem, see [...]Skype doesn't works either , a lot of echos.Don't buy this thing. Pretty but awful. 1299.00, my worst buy ever.", "Date": "September 24, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000RH2M2U"}}