{"Reviews": [{"Title": "HP Compaq nc6400 Business Notebook (Refurbished)", "Author": "808IsLaNDGiRL", "ReviewID": "R7P9DVZLG5BSG", "Overall": "5.0", "Content": "I've been an Amazon customer for nearly a decade and haven't had any issues with Amazon or any sellers. With all of the items and thousands of dollars spent on this website, this is the very first \"review\" I am writing. I was very hesitant about purchasing this refurbished laptop. You don't really know what you are actually buying with transactions like these.I purchased my laptop from GothamCityMall. We received the package via USPS a day earlier than expected, was not expecting that! So I really didn't know what to expect when I opened the box. And boy was I surprised! After removing the various layers of bubble wrap and tape, I unwrapped a pretty cool-looking piece of machinery. It is definitely an old model, but it still looks just as sexy as the new guys out there on the market today. Also, the laptop may have been refurbished, but it looks far from used! Cosmetically, it was almost perfect except for one tiny scratch on the cover. The keyboard, screen, battery/cords were also in new condition. If I didn't know any better, I would think this machine was brand new. I really got lucky with this one!Before purchasing this refurbished laptop, we had the pleasuring of using a relative's brand new Inspiron Notebook for almost 2yrs. Although my nc6400 isn't quite as sleek in the looks department, it does pretty much everything that the Inspiron did. I'm pleasantly surprised!It handles multiple windows of web browsing, creates documents w/ease, plays Netflix videos (sound is great), and whatever else you can throw at it, all at the same time...without any problems with performance. The physical size and weight of this laptop is perfect! I hated lugging around the huge and incredibly heavy 15\" Inspiron. This thing is a baby in comparison! The layout of the keyboard and the feel of the keys is wonderful. I also like the matte screen compared to the high-gloss screen of the Inspiron. Fingerprints from my 2 1/2 year old are much less noticeable. My most favorite feature on the keyboard itself is the handy row of buttons at the top, volume included. The Inspiron didn't have volume buttons, making it quite an inconvenience to make adjustments.I'm not sure if I will be using this laptop to play games, but I'm sure it can handle it without a problem. We'll have to see though. I haven't watched DVD's or listened to music on it yet either, but I do love that I can burn DVD's or CD's as well. The 3 USB ports are handy; I'm only using about 2 at a time for my flash drive and wireless mouse. The smart/memory card slots are also handy for a family like ours that takes a lot of pictures.Because this machine was built for the office (I use it for Home), it has many features that I don't have the need for. They are great tools to have when and if I decide to use this machine in an office setting. The one \"office\" feature I do use is the Fingerprint Scanner. It's pretty cool and easy to set up.If you are debating between buying a new/newer laptop or even a used version of this laptop, stop fighting with yourself. It is risky buying used/refurbished electronics online, but it's a risk I'm so happy I decided to take. I spent less than $200 (shipping included) on a quality piece of machinery that does everything that I need it to do, and is comparable performance-wise, to the newer and MUCH MORE expensive laptops that are selling now.", "Date": "February 29, 2012"}, {"Title": "Great buy", "Author": "Gnome Computer", "ReviewID": "R16GQCC8M0801G", "Overall": "5.0", "Content": "No long review here - just wanted to say that I am very happy with the product! It is used so a few bumps and bruises are expected, but it's in great condition and works wonderful.", "Date": "November 28, 2011"}, {"Title": "great PC", "Author": "brandon bishop", "ReviewID": "RTUTO4IWM5U6Z", "Overall": "5.0", "Content": "i bought this refurb pc and i really like it.it has great sound and is pretty fastthe graphics are great for the average person.the seller was really good about the warranty and responded to my questions promptly.i would buy another one of these", "Date": "March 1, 2012"}, {"Title": "What I was looking for and more.", "Author": "Larry C. Copeland \"copelarry\"", "ReviewID": "R2CSN9AS3OGY9Z", "Overall": "5.0", "Content": "A great price for a great laptop.  I have a new laptop with Windows 8 and I like this one much better.  I will sell the new one now.  Great comunacation with the seller too.  BIG plus.", "Date": "December 13, 2012"}, {"Title": "HP NC6400 by Compaq", "Author": "Melissa M. Hoffman", "ReviewID": "RVW6TV20QHAND", "Overall": "5.0", "Content": "This computer is a wonderful laptop computer with a nice screen size. I like the speed of the laptop which contains a centrino processor. It also came equipped with plenty of disk space and memory. I think they are a great buy for the price, I bought mine used.", "Date": "July 3, 2012"}, {"Title": "Will work out well!", "Author": "Robin Larson", "ReviewID": "R1LVF9DAIB253U", "Overall": "4.0", "Content": "I bought this as a \"second\" computer to replace my old second computer which is an old Dell laptop (since Windows XP no longer will be supported).  I had to call the seller to find out what was up with the wi-fi not connecting, and he told me how to update the wireless drivers, and I think I'm going to quite satisfied.", "Date": "April 2, 2014"}, {"Title": "works well", "Author": "God is a refuge for us (Psalms 62:8)", "ReviewID": "R1PELV301BF4OR", "Overall": "5.0", "Content": "It works well. I purchased it used. I wouldn't use it as my main PC. It's just something that I would carry with me while traveling. It's small, lightweight, and it gets the job done.What I like about it:* The keyboard is normal size.* The touchpad works fine.* It has plenty of ports for connecting devices.* It's fast enough for me (surfing the web, checking email, OpenOffice, listen to music, watch movies, etc.)* The screen is large enough; it's bright and has good color* It includes a DVD/CD drive* It's reliable, good quality, and well made* Wireless card included (for Internet)I removed all non-essential software from it, including the \"fingerprint security detection\" software. This helps to keep it running fast.With adequate padding included, the notebook, cord, and charger fit nicely inside a USPS Priority Mail medium flat rate box (13-5/8\" x 11-7/8\" x 3-3/8\"). And that works great if you are giving it as a gift (like to a soldier who needs one to keep in touch with family/friends back home).Things to keep in mind if you are purchasing it used; verify that...* it comes with an operating system like Windows XP* the battery, charger, and cord are included* the battery still hold a charge (unless you just plan to plug it in when using it)* it has enough RAM memory for your needs* it is in working orderI'm pleased with my purchase and would buy one of these notebooks again, if needed.", "Date": "October 24, 2013"}, {"Title": "Wrong Charger", "Author": "denton burt", "ReviewID": "R2ZYM4LOZAGVSR", "Overall": "1.0", "Content": "Wrong ChargerI got the wrong charger with the lap top. It is not charging. I am getting a message saying the charger is too small . I did not expect that kind of service at all", "Date": "June 25, 2013"}, {"Title": "Great Buy!", "Author": "Dea Stevens", "ReviewID": "R20YRAF9I22SRG", "Overall": "4.0", "Content": "I only rate this computer 4 stars because it is not new, otherwise it is Just Like new!  Its faster than my home PC and I have absolutely no complaints. I plan on buying my grandson  a used computer from this company for Christmas!", "Date": "April 11, 2013"}, {"Title": "Good", "Author": "Jacqueline", "ReviewID": "RZJWNKBYM8YUS", "Overall": "4.0", "Content": "Computer came on time...a little heavy and gets very hot when charging..and battery only last an hour..will use until I can find something better", "Date": "January 22, 2013"}, {"Title": "no customer service", "Author": "tony", "ReviewID": "R2FKO54T971CM7", "Overall": "2.0", "Content": "I bought two of these lap tops they work as they are supposed to but the batteries in both laptops were junk. I couldn't get a response from the seller when I inquired about the batteries I will never buy from them again......", "Date": "January 13, 2013"}, {"Title": "it didn't work when i first  got it", "Author": "phil", "ReviewID": "R3NQOLVEJN6TK2", "Overall": "1.0", "Content": "It didn't work the person or the people who sold it I think they knew  it didn't work all that money is gone down the drain", "Date": "December 30, 2013"}, {"Title": "Excellent!", "Author": "John Milne", "ReviewID": "R11KJYUHQ2GL5N", "Overall": "5.0", "Content": "it's a GREAT as it was described in fact the service is also met its time-length, moreover it came with great condition.", "Date": "October 2, 2013"}, {"Title": "Good computer.", "Author": "Johnny Thorazine", "ReviewID": "R2BGWR1382UP6Q", "Overall": "4.0", "Content": "The drive crashed in transit, but I happened to have a copy o HP windows sitting around, so I fixed the problem. This particular model has a problem with the touch pad going all crazy, so a usb mouse solves that problem. Now the computer runs magnificent! And the company I bought it from was extremely helpful, though I was cranky and less than a stellar client. Cudos to them!", "Date": "September 7, 2013"}, {"Title": "My husband loves it!", "Author": "Mary Kate Leahy", "ReviewID": "R1NN18HHMIA6HJ", "Overall": "5.0", "Content": "I bought this laptop for my husband.  He uses it mostly for Facebook and email, but says that he loves it.  It is much, much faster than our old laptop and he is very pleased with our purchase!", "Date": "July 11, 2013"}, {"Title": ":/", "Author": "Jessica W.", "ReviewID": "R1DBOY8ZDMOD92", "Overall": "3.0", "Content": "I have a refurb and the screen went out so I have to hook it up to my old monitor but for the deal it's still pretty damn good. I'm going to just hand this one down to my daughter though and get myself a better one.", "Date": "June 3, 2013"}, {"Title": "Good buy", "Author": "leroy chappell", "ReviewID": "R10BUVQGDAVN5K", "Overall": "5.0", "Content": "The computer is in excellent condition for the price. I had a small problem with cd player but company resolve very quickly. \"Thanks T.L\"", "Date": "June 2, 2013"}, {"Title": "excellent", "Author": "ANIBAL PACHECO", "ReviewID": "RV9UZQP1L02VF", "Overall": "5.0", "Content": "It is and excellent computer,It get all I need, Its quick and powerfulI GET IT FOR A PRICE VERY SHEEP.", "Date": "May 30, 2013"}, {"Title": "Perfect!", "Author": "Stephanie S. Chaousy", "ReviewID": "R11TBAJMXQUEYW", "Overall": "5.0", "Content": "It came so quickly and it is exactly what I was looking for.  It was in really great shape considering it was refurbished.  Not a scratch.  The price could not be beat anywhere.  Thanks so much!", "Date": "May 23, 2013"}, {"Title": "literally fried in 2 weeks, only started the computer 3 times", "Author": "SANDRA BOUMANS", "ReviewID": "R3SUOLQ6V50G04", "Overall": "1.0", "Content": "it was a gift for my niece...she did not get it until her birthday in March...it would not boot up the 4th time she went to start it.  It had some sort of electrical problem.  checking it out after it would not start up, I found the battery was dead and would not hold a charge and the hard drive not even recognized as being in the machine.I believe there was an electrical problem with the machine or battery and it fried the computer.  I do not believe the machine was inspected an thoughly as it should have been before selling it.Of course ,  since it was a gift, the warrenty is long past and my neice is stuck without a computer and I am stuck with a very expensive paper weight.  I am one VERY unhappy customer.", "Date": "May 1, 2013"}, {"Title": ":-)", "Author": "annie a", "ReviewID": "RKGT1HDLISRW6", "Overall": "5.0", "Content": "I haven't heard any complaint from my uncle about it yet.  I would recommend it to anyone out there, if you don't want anything complicated.", "Date": "April 20, 2013"}, {"Title": "My cousin.", "Author": "Tonia Walker", "ReviewID": "R2P1YBZY9EWR5E", "Overall": "5.0", "Content": "My cousin was in bad need for a computer to take her online courses, so I helped her out. She loves this!", "Date": "January 18, 2013"}, {"Title": "Easy to use computer for my kids", "Author": "J. Renee Johnson \"Sassysapphires\"", "ReviewID": "R1UFMO92FPNPQ5", "Overall": "5.0", "Content": "I bought 2 of these for my kids for christmas and they love them!  Easy to use and cheap enough for me to buy them each a laptop of their own.", "Date": "December 27, 2012"}, {"Title": "Bad purchase, doesn't last", "Author": "M. Berger", "ReviewID": "R29BE47IB0JW00", "Overall": "1.0", "Content": "Buyer beware! While it may work fine at first, it will break in no time! I purchased this laptop less than a year ago, and although I was extremely careful and gentle with it, it is completely useless right now. The screen keeps fading, and only extreme and constant pressure on the screen at a certain angle will bring back the content. However, it's not possible to type and work on it while putting pressure at the same time. So I'm left with no laptop in the middle of a college course :( I tried contacting the seller over a week ago, and haven't received a response at all. This is by far my worst purchase ever!!", "Date": "July 3, 2012"}, {"Title": "Ugh", "Author": "Brian J Ellis", "ReviewID": "R5NJME4EDDWB4", "Overall": "1.0", "Content": "Idk what's up here but it's very slow. And I can't get help because their hours are east coast time and only Monday thru Friday. Even with wifi video doesn't play smoothly and it doesn't do DVDs well either. I'm better using my iphone for these tasks and that isn't even it's job.", "Date": "April 7, 2013"}, {"Title": "detalles pero en buenas condiciones", "Author": "Gladismil Gonzalez", "ReviewID": "R5ARB5TCCJIXO", "Overall": "4.0", "Content": "the team is in very good condition but did not come with original charger and that made it to buy a genuine charger not charge t", "Date": "October 7, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000FOG604"}}