{"Reviews": [{"Title": "FANTASTIC laptop but has some minor quirks", "Author": "SWL", "ReviewID": "R1JDDRPY4JI17C", "Overall": "5.0", "Content": "Greetings all, the other review by Sherrila Levin for this item is inappropriate and overzealous (I'm a die-hard Mac fan).  Make no mistake this is a PHENOMENAL computer yet there are some buts...In a nutshell:PROS:- You're walking around with 17\" gorgeous object of envy that has a stunning display great for games, DVDs, doing PhotoShop/Illustrator work, etc.  The great screen ratio is perfect for design apps with palettes, toolbars and the like.- For a laptop, GREAT sounding speakers- Backlit keyboard: Nifty little feature that is best when you have it plugged in.  Otherwise, works well, but is an added drain on the battery when going mobile.  Though, the AMBIENT LIGHT SENSOR that adjusts screen brightness and backlight is AWESOME when it fades in to let you know it's working.- Usual suspects of big hard drive, fast processor, pretty snazzy 3d card, lots of ports, DVD & CD BURNER and loads of RAM make for a REALLY AGILE portable workhorse.- It's always great owning something where you can see the designers put oodles of love and obsession to detail.- Slot loading drive (has no breakable moving doors)- Does not generate heat like previous G3 models or earlier G4sCONS (Few and almost trivial, but worth noting for the uninitiated):- 6.8 pounds isn't the lightest thing in the world if you're lugging it around on one shoulder- Shell is slightly soft and gives way to some small body damage easily (I accidentally dropped mine on the corner from about 1.5 ft off the ground - now have a nice ding.  Other users/reviewers have also mentioned this issue as well).  Just don't be as klutzy as me and you should be fine.Hope this helps.", "Date": "November 17, 2003"}, {"Title": "A joy to use, and road-ready to a T", "Author": null, "ReviewID": "R1PMOFN76IEBRH", "Overall": "4.0", "Content": "This aluminum-shelled gem marries beauty and brawn so well that that owners of lesser laptops will surely have a hard time hiding their envy. It's fast and capacious and, like other Apple products, a joy just to take out of the box and see how Apple has thought about every step of the user experience, from unpacking to setting up the built-in wireless networking (a total breeze, and I'm a klutz at that kind of thing). In that same vein, there's the G4 Powerbook's keyboard that automatically lights up with a soft glow from underneath the keys as the light in your office or your airplane cabin dims. It's a small thing, but indicative of a genuinely respectful, design-centric, user-oriented mindset that no other computer company can match.The display is lovely to behold and s-h-a-r-p, and the wealth of (count 'em) 1.3 million pixels makes it hard to go back to my 15'' flatpanel iMac desktop screen. Watching a DVD on a Powerbook screen this big and this good is about as satisfying as visiting my local cineplex, sans the sticky floors.Like the new G5 desktops, the G4 Powerbooks strike me as quite hi-tech and futuristic. That's not a bad thing, but it's a far cry from the happy candy-colored iBooks of a few years ago. The G4 Powerbooks are also not as \"warm & inviting\" as the current generation of elegant white Powerbooks. The persona of the G4 machines is a bit more stand-offish, stark even, and you either like that or you don't. I think they're plenty gorgeous but, at the risk of sounding sexist, my hunch is that it's a 'guy' computer, and that a lot of women won't take a shine to these machines. But I'll let Apple's marketing department worry about that.Finding Panther (Mac OS 10.3) loaded on this machine was a greater boon than I'd imagined. I've used 10.2 (Jaguar) since it came out in August 2002, but Panther is such a big step forward, it almost qualifies as a whole new operating system -- without the learning curve. You can log out without quitting open applications, for instance, in a matter of literally seconds. The improved Finder -- which appears to be modeled in part on Windows XP, though no Mac user would admit that without the benefit of thumbscrews ;-) -- makes navigating through complex hierarchies of folders and files a snap, and it's easy to customize. Also, Apple has brought back color labeling of files and other items -- an OS9 staple it stupidly discarded when the company launched OSX a few years ago. There are more than 150 other big and small improvement (wait'll you get a load of a feature called Exposé, which displays all your open windows, across applications, at the roll of a mouse!), but this is supposed to be a review about the computer, not its operating system.Well then, the G4 17'' Powerbook is a tactile and esthetic pleasure to use. The fit is tight, the finish beautiful. Everything just works right out of the box without the user having to study manuals or spending time on the phone with tech support. I would gush about this machine (and so far I have!), but there are a few minor points of criticism, too:- Apple does sometimes put good looks over practicality. The shell of this Powerbook has no ridges on it -- it's just this sleek, smooth expanse of aluminum. Very purty, but since this is a large and relatively heavy laptop, you're quite likely to let it slip from your grasp at one point or another. Some kind of grip would have been a good idea. Also, there's a latch at the front of the machine that you push to unlock the screen. The latch is almost perfectly flush with the front of the case (so as not to visually break the sleek line of the shell, I'd wager), and I find that it sometimes takes two or three pushes before the screen pops open.- The material looks like it might scratch easily (but I'm trying not to find that out first-hand). At this price -- 3,000 semolians! -- Apple should have included a soft leather sleeve or something, so that you can toss the thus-protected Powerbook into a shoulder bag or backpack and not worry about it. I ordered a neoprene third-party solution called a Sportfolio (40 bucks) that does the job.- I've been forced to use them for years and I still don't like 'em: trackpads. Ugh. Get a mouse. Kensington makes one that works well with a Powerbook; it has a retractable USB cable that stores inside the device when not in use.- The power cord plugs into the side of the machine. That's a bit unsightly. It should have been in the back, where it essentially doesn't show.- More visual clutter: the sides of the machine. They're outfitted with a bevvy of ports, including a Firewire 800 port and an S-video socket (excellent!) and no cover (not so excellent). I realize doors can easily break off, but maybe a molded rubber strip would have (a) been better-looking, and (b) kept dust, dirt, and lint out.- Apple should take a cue from the automobile industry and its included standard 3 year/50,000-miles warranties. The Powerbook has a one-year warranty and only 90 days of phone support. To extend coverage to three full years, you're supposed to purchase a protection plan for -- gulp -- 350 bucks. I guess I'll do it, but I have the uncomfortable feeling I'll be paying for a few years' supply of Steve Jobs's black turtlenecks. I'm OK with him playing hardball with Disney, he just should let up on his own loyal customers a bit. ;-)I've had the G4 17'' Powerbook for a week and intend to really put it through its paces in weeks and months to come. So far, the verdict is very positive. The first Apple Powerbooks, in 1992, also cost multiple thousands of dollars, just like this one. For the same money (less if you count inflation), you can now buy a super-good-looking supercomputer that is a kick-ass music player, an excellent movie-playback machine, a top-notch number cruncher, a high-powered portable recording studio, a serious photo- and video-editing tool, and on and on... I shrugged when I heard about Apple's plans, three or four years ago, to turn their computers into \"hubs for the digital lifestyle.\" But the company did just that, and no portable computer today is a more capable, pleasure-to-work-with digital hub than this gorgeous 17'' G4 Powerbook.Addendum: A few weeks after I wrote this review, I'm on a plane, with the Powerbook in its neoprene sleeve tucked safely in the overhead luggage compartment. Well, maybe not SO safely after all. After touchdown, people start grabbing their bags, anxious to get out -- and some idiot yanks her own luggage out so hard and carelessly that my computer goes flying. It drops in a graceless arc, like a limply flung brick, and lands with a thud that churns my stomach. I actually gasp. This is more abuse than any consumer laptop can handle. After all, it's a fall from almost seven feet high; surely the case is cracked, or the screen broken, or the hard drive knocked out of whack and my data lost -- or all of the above.  Absurdly enough, though, I'm wrong. I zip open the sleeve, fingers trembling, but all is as it should be. The aluminum case is un-dented and as tight as ever; the screen unblemished; the hard drive unperturbed. Now, I wouldn't care to duplicate this little involuntary experiment. Clearly I got lucky. But it's also proof that Apple builds its Powerbooks with real structural integrity -- equipped to deal with the rigors of the road, and with the abuse inflicted on it by hapless users and clumsy strangers alike.", "Date": "February 1, 2004"}, {"Title": "Best Laptop Ever Made!!!", "Author": "Miguel Ali \"Film Director & Political Pundit\"", "ReviewID": "R1KXYZSQHXTF33", "Overall": "5.0", "Content": "I don't know what more I can add to all of these great reviewsbut believe the hype!!!this is one AWESOME laptop!I'll just make a list of why I love it --- forgive me if it comes off with any irrationality ---1. Portability ---- seriously, feel free to laugh, but this laptop really is portable....... yes, it can get heavy (by the end of the day) but it really is comparable, if not lighter, than most laptops available......... I commend Apple for doing such a great job on actually making this computer portable enough to throw in a backpack and take with you2. The Widescreen 17\" screen!!! gosh this screen is beautiful! Sometimes I find myself using a smaller computer and I can't stand it ---- I've officialy been spoiled! Even 15\" widescreens won't do anymore!3. Keyboard ---- there's something special about this keyboard - its pretty cool4. Speed ---- Apple gets knocked around a lot for its speed, but seriously, the G4 in this thing really handles things greatly! I highly recommend 1 gig of RAM, for the ultimate speed and stability ----- this thing will run Final Cut Pro, Garage Band, OS X, all of those programs, greatly! Take my word for it ---- no probs at all!5. Stablity ---- this is more of a software thing, but OS X is such a great OS!!! Never freezes, never crashes ------ I have five different apps open right now (Safari, AOL, Preview, MS Word, and iTunes) and the speed isn't slowing down one bit!6. Output options ----- were talking Firewire, Firewire 800, USB, DVI, best of all, SVIDEO and AUDIO output ---- making it VERY easy to connect this baby to a nice TV!!! its pretty freaking coolI don't know what else to say ---- buy it! IT ROCKSfor those of you afraid to switch, let me give you reasons why ---- Microsoft Office on OS X (which works better here than it does on XP)- Final Cut Pro (better than any Windoze editing system)- All Adobe apps available here- All Macromedia apps available heredid I forget anything?", "Date": "February 19, 2004"}, {"Title": "It replaced this professional's desktop!", "Author": "Nathan Moody", "ReviewID": "R2F4H0URYD58P6", "Overall": "5.0", "Content": "Yes, yes, it's heavy and hot as hell. This is not the machine you prop up on your legs to read Google News in bed. Hopefully you have something better to do with your US$3K-$4K anyway.I'm a professional media designer and image maker, and I replaced my old dual-processor Macintosh with the 17.1\" 1.33 GHz Powerbook. This is a machine to tote onto a job site or to a presentation and produce great work...perfect for freelancers and those who might not work at their home base all the time.Two great things I've not seen other reviewers mention are the audio hardware quality and dual-monitor support; these can't be under-rated. My Dell PC's audio line out is noisy and full of hiss, while the Powerbook's line out is so quiet that many musicians simply plug it into a club's audio system and it sounds great. Dual-monitor support is second to none. After chafing a bit at the widescreen nature of the screen (i.e., only 900 pixels tall), I instantly shut my mouth when I plugged in another monitor and it immediately started running at 1600 x 1200.While there are some compromises one must make in going mobile, this machine does not disappoint. Rear legs for improved elevation, easy expandability, even a real tray for the DVD-RW drive ... all these things have been removed to make the machine as streamlined as possible. But I happily accept all these compromises to use a Macintosh that is powerful, relatively lightweight, portable...and sexy as all get-out. It's the only computing device I've ever owned that is a conversation starter. Now if these people would only just let me get back to work...", "Date": "March 8, 2004"}, {"Title": "Great computer, few flaws", "Author": "Robert Graves", "ReviewID": "R32N71H5V7YZ9X", "Overall": "4.0", "Content": "Yeah, I know it's a little more money than the knock-off PC clones from Dell and Gateway, but this is a far superior computer. The Mac platform is not only the most powerful one available, it is also the simplest and most versatile - once you learn it.The 15-inch is the perfect size for me. I looked at both the 12 and 17-inch models and felt they were a little too small/big respectively. There is something attractive about the 12 inch - a friend of mine has one and he carries it around everywhere, able to write anywhere anytime. And seated at a desk the 17-inch is also attractive, presenting a massive, bright screen to work on. But all in all, the 15-inch provides the best both worlds. It's very portable - maybe not as easy to tug along as the 12-inch, but certainly manageable with a small backpack. The 17-inch can be problematic on a plane if there are people crowding you, and it's certainly cumbersome to maneuver in tight spaces, whereas the 12-inch is easy to maneuver but can cause a little eyestrain from a distance.I definitely recommend a Mac, first of all, and within that I recommend the 15-inch G4 notebook. If you must have a 12-inch, you might take a look at the 12-inch iBook, which is cheaper but obviously not as feature rich (the iBook's graphics card is not as powerful and the processor is slower, most notably).The complaints I have are exterior - the computer doesn't age well (i.e., it nicks and scratches rather easily) and there should be some sort of elevation device to raise the back end while typing (like the older Powerbooks had).All in all you can't go wrong with any Apple laptop you choose. They are truly making the digital life a reality with all of their integrated software - iTunes, iPhoto, iSight, and the iPod are particularly cool. No other laptop will have an operating system with so many fantastic programs that are so perfectly integrated together. If this is remotely in your price range, go for it. It can literally change the way you operate on a day-to-day basis.", "Date": "February 18, 2004"}, {"Title": "Best computer I've ever owned", "Author": "Zach Everson \"Writer. Editor. Consultant.\"", "ReviewID": "R2BQVGJ24DBUVS", "Overall": "4.0", "Content": "I bought a 12-inch Powerbook after I gave my old Sony Vaio notebook the Pete Townshend treatment - I put my fist through it. (Yes, it looks like a stained glass window.) I hadn't used a Mac in years, but I decided I'd had it with Microsoft and Windows. All it took was one weekend and a good book - \"Mac OS X: The Missing Manual,\" by David Pogue -however, and I mastered the machine.(Other than the size of the screen, the 17-inch model is the same as the 12-inch one.)SOFTWAREThe computer comes with some great software. iTunes is the best media player on the market. I have almost 5,000 songs stored on mine. With the search function and browser display, it is easy to find a particular song. iTunes also keeps track of the number of times you've listened to a song and it allows you to rate your songs. It's easy to create a playlist. Also, burning one of those playlists onto a CD can be done with one click.Safari is a great web browser. It has a Google search box built into the toolbar, prevents pop-up ads (I've never had one), has tabbed browsing (preventing a cluttered desktop), and allows for bookmarks to be added with one click.iChat allows Mac users to customize their AIM and Rendezvous chat sessions in ways that the normal applications don't allow, such as adding pictures from iPhoto to their profile.I haven't mastered iPhoto yet, but it is downloading pictures from a digital camera is as easy as plugging it into the USB port and clicking a button.Also, Macs are less likely to get a virus or be overtaken by spyware.The iCal and Address Book look good, but if you are going to sync a PDA with your Mac, you are better off using Palm Desktop software. Hopefully the functionality of those programs will be improved in the future though.Finally, most of the programs work with each other. For example, if someone on my iChat buddy list is online, a green dot will appear next to a message from him or her in my Mail inbox.I also use Microsoft Office, Quicken, Dreamweaver MX, and Palm Desktop - they all work well on the Mac. Office shares files perfectly with PCs.HARDWARESpend the money and get the superdrive (CD-RW/DVD-R). DVDs have more memory than CDs and blank DVD-Rs are becoming more affordable. If you are into collecting videos of concerts, a DVD-R is a must.I'd recommend upgrading to at least 768 MB of memory and the 80 GB hard drive. Burning a DVD requires a lot of memory and can take a while - this way you can use other applications while burning a DVD (on my old PC, if I was burning a CD, I couldn't use anything else). The hard drive space is really cheap. Plus, if you load your CDs on your computer, they can eat up a lot of memory, even as MP3s (my 5,000 songs take up about 25 GB).Also, there is a lot to be said for getting the Airport Exteme card (although you can buy a third-party base station for less). I am able to browse the Internet in any room of my house - well worth the extra $100 or so.I have the 12-inch monitor, but that was because Apple hadn't released the 15-inch in the new style when I made my purchase. The 12-inch is fine - it's much clearer than my old PC notebook - but if I had the opportunity, I'd probably go with the bigger monitor.DRAWBACKS-While most software is available for Mac OS X, there are some programs that aren't (Google toolbar, Yahoo! toolbar, Kazaa, AvantGo) or minor problems in software that is available (Quicken can't access accounts on Ameritrade via Macs)-The PowerBook doesn't have a fan, which is great for the battery, but can cause it to get a bit hot underneath where the user rests his left hand.Regardless of those drawbacks, however, buying a Mac was an easy decision. If you have any questions about it, click on my profile and send me a e-mail.UPDATE: After 14 months, the hard drive started making noise and system performance got slow and I couldn't run as many programs as I used to. I called Apple and had to spend $300 for them to put in a new hard drive and some other hardware. They were unable to transfer my data to my new hard drive, so I've spent the past four days reloading all of my software and applications. No idea why the hard drive went. Hence I dropped the rating from five stars to four.", "Date": "April 13, 2004"}, {"Title": "A Must Have Desktop replacement", "Author": "Nedim Heto \"nheto\"", "ReviewID": "R3Q5UBBWDZ3DK0", "Overall": "5.0", "Content": "I just purchased the newest Powerbook G4 with a stunning 17\" display, a blazing fast 1.33GhZ processor and I just haven't been able to put it down. This computer is as well packaged as it is designed. The screen is bright and beautiful. The trackpad is responsive and large enough for even the biggest or the smallest of the hands to use. It has a CD and a DVD burner and not to mention Wireless capabilities built right in it. The coolest new feature I have to say would be the sensor controlled illuminated keyboard that just amazes the heck out of me.The machine is the fastest I have owned and with OS X Panther -- this laptop leaves the rest behind.The only drawback is the price which for some people might be a bit over the top, but considering the product you are getting it is well worth it.An absolute must buy.", "Date": "January 15, 2004"}, {"Title": "I switched from 10+ years of Microsoft's platform, MACS rule", "Author": "J. Cartzendafner", "ReviewID": "R32W84LTGTNV8P", "Overall": "5.0", "Content": "This powerbook is a work of art..  Very well thought out from the hardware to the software..... The windows platform has only one advantage over Mac products ....their price point. I have had this Powerbook for 2 1/2weeks and have only used my PC three times (to get files I needed). I know the prices are higher on the Mac side, but the money is well spent.....  If you can afford a MAC then get one, you will not be sorryHope is helps someonebest of luckJD", "Date": "August 4, 2004"}, {"Title": "Great laptop...one thing i hate", "Author": "\"maclover194992\"", "ReviewID": "R8ICSA97Q23S3", "Overall": "4.0", "Content": "I personally love this laptop....it's the best i've seen. 1.33ghz. Great speed. Lots of memory and love the Airport Extreme. One thing I don't like is the case. Your fingerprints will show like crazy but, don't worry about that..It's still good. I'm already burning movies in the first month. Love the Garageband, iTunes, iPhoto, iMovie, and iDVD. Great stuff comes with this computer. I just preorded Microsoft Office v. X. I'm sure I'll love it. Anyway, overall...I give this computer 4-stars. If the case was better...5 ALL THE WAY.P.S. Be sure to get the extended warrenty...you may need it. My 800mhz iMac just broke and I was 2 days away from my policy expiration date. Good thing i kept the receipt.", "Date": "April 13, 2004"}, {"Title": "Nice", "Author": "Rose", "ReviewID": "RY7D6RU457HCO", "Overall": "5.0", "Content": "I love this  Mac it's perfect it came with every thing I needed for school and it was easy to put Light-room on it it's perfect!:-)", "Date": "September 17, 2013"}, {"Title": "You will love this system.", "Author": "sherrila levin \"the la\"", "ReviewID": "R108T17WZ9F93U", "Overall": "5.0", "Content": "This machine is a replacement for your desktop.  It's that powerful and versatile, and if you're a windows user, the design of the OS X operating system that it runs will enhance your experience and workflow in ways you can't even imagine.  The aluminum frame beats the old titanium design easily.  Solid, resistant to scratches, better heat dissipation.  Close the lid, then slam it around, drop it, prop it against the wall and kick it over.  You'll break your foot before you break the laptop.  The display is large enough, and the text rendering is sharp enough, that you'll forget entirely about workspace issues.  A piece of advice: Get the new logitech optical USB mouse with the little app-switcher button on it, and assign that extra button to the Expose feature of OS X 10.3.  Use it whenever you're working at a tabletop or desk.  Freaking brilliant.  This machine will change your whole idea of what a laptop should be.", "Date": "November 13, 2003"}, {"Title": "Good system, a few complaints", "Author": null, "ReviewID": "R3Q28LQM84WMFI", "Overall": "3.0", "Content": "I got this Powerbook for my wife and I got a new desktop system.  I just have a few complaints about this PB:Poor battery life - we only get about 1 hour of use if we are using it.  If it's sitting idle the batter last longer, but what good is that?Flimsy case - it's pretty, but we've already scratched it twice and there is a crack on the bottom.  This isn't covered by the warranty, but if they are going to use cheap cases they shouldn't charge so much.Things I love - the screen is very nice and I like having a big hard drive.  (Despite what people say the drive isn't all that loud so go for a big hard drive.)", "Date": "March 22, 2004"}, {"Title": "First Class Computer -- Need Upgrades for Support", "Author": "Michael Smith", "ReviewID": "RBIIIB5FEBIBX", "Overall": "2.0", "Content": "As other reviewers have stated, the hardware itself is great. The computer is visually stunning. And the OS is rock-solid and user-friendly.Some people have complained about the size for traveling. It's about as small as a 17\" computer could be -- but if you are sitting in coach and the person in front of you reclines their seat, it's hard to use. (Get the 12\" if you think this might be a problem for you.)Finally, a word on Apple service. I had some problems with this computer and needed to send it back to Apple several times -- which is a bad thing. On the other hand, I finally reached Roberto, a Powerbook specialist in AppleCare, who was understanding and expedited my repair -- which is a good thing. 4-stars -- would have been 5-stars except for the hardware problems.", "Date": "July 7, 2004"}, {"Title": "PowerBook review", "Author": "ddupr21", "ReviewID": "R2K21PTVSKQHNT", "Overall": "2.0", "Content": "Unable to use it with Rosetta Stone, which is why I bought it. Also couldn't use it to watch live tv on it, software issue with Microsoft.", "Date": "May 10, 2012"}, {"Title": "Best machine on the market", "Author": null, "ReviewID": "R2FK62FFGPX603", "Overall": "5.0", "Content": "I run a large number of operating systems on my PowerBook 17, both because I am fascinated by operating systems and environments, and also because a lot of my professional work is and has been in this area (in other words, I legitimately need to run quite a few of these systems). It is helpful to think of the setup as an \"iPod of Operating Systems\" - I use a portable external FireWire drive that contains all the systems. I run 61 Operating systems on this thing, unmatchable.", "Date": "March 9, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "The new PowerBook family gives you power in a choice of three ultrafast portables\nWhether you prefer the ultra-compact 12-inch model, the coveted 15-inch powerhouse, or the stunning 17-inch beauty\nThe PowerBook G4 is resistant to stains and scratches\nYou'll marvel at the way supersharp high-resolution TFT XGA active-matrix display fits into such a compact frame\nTo see it is to feel the strong stirrings of technolust", "Name": "Apple PowerBook Laptop 17\" M9110LL/A (1.33-GHz PowerPC G4, 512 MB RAM, 80 GB Hard Drive, DVD-R/CD-RW Drive)", "ImgURL": "http://ecx.images-amazon.com/images/I/4136S277NZL._SX300_.jpg", "ProductID": "B0000D8DLH"}}