{"Reviews": [{"Title": "Better Than Expected!", "Author": "Ethan Hartman", "ReviewID": "R2M3KCNUIUS1WS", "Overall": "5.0", "Content": "When I first went to buy this, I though to myself, \"It's an old version, so I might have to return it.\" I was way off! This is very fast and responsive. I figured 120GB wasn't a lot, but apparently, at this price, it's very rare! Mine did have a scratch or two, but the old tooth paste method fixed that up fine!", "Date": "September 21, 2010"}, {"Title": "this mac is great!", "Author": "Sol", "ReviewID": "R2FBBAL5VH2Y5F", "Overall": "5.0", "Content": "I got it on time and the computer was more than I expected. It runs well and its as if I had bought it at a mac store :)", "Date": "July 21, 2010"}, {"Title": "13.3 \" MacBook older version", "Author": "tigerlily2k7", "ReviewID": "RQ3VD050KSMEV", "Overall": "5.0", "Content": "I love this laptop. I have always been a windows user but I got an iPad and when I became partially disabled and could no longer sit at a desktop and had to get a laptop I decided to try a mac, I am lovin it. It took a bit of getting used to but it's great. It has everything I need for my homemade crocheted gifts business.", "Date": "May 30, 2012"}, {"Title": "This Computer Was What I Was Looking For!", "Author": "Deborah Zygmont", "ReviewID": "RV2USI9DGIAZA", "Overall": "5.0", "Content": "I knew I wanted an Apple Mac for my creative husband but didn't want the expense that goes with it.  I was extremely pleased with the refurbished model that was fully loaded and purchased through Amazon.  My husband is pleased, enjoying all of the features of a Mac and I feel I got a bargain!  Thank you so much!", "Date": "November 4, 2011"}, {"Title": "Love the Computer-broken charger", "Author": "raapelhs", "ReviewID": "R1CVUP697KLE48", "Overall": "4.0", "Content": "I purchased this computer because my macbook pro was stolen in march. it was a great price and i love it..it works pretty much exactly like how my macbook pro worked. the only issue i had was that sometimes the charger that came with the computer would not charge the computer. because of this, i had to buy a new one for 80 dollars at the apple store. however, everything else worked great and i recieved my computer 2 days after i ordered it!", "Date": "September 2, 2012"}, {"Title": "Laptop was in very poor condition and listed as \"very Good Condition\". It had missing screws, cracks, dark spot in the screen", "Author": "DrueP", "ReviewID": "R3R6AZTN67ZZ79", "Overall": "1.0", "Content": "The first thing I noticed was how poorly the laptop was packaged, by some miracle it did not get damaged in shipping.  The problem is that the Laptop was described as in \"Very Good Condition\" and it was far from being in good condition. The top and bottom of the laptop has cracks and deep scratches, much worse that would what would even be considered in Fair Condition. I understand white MacBooks get scratches that does not bother me. This laptop looks like someone put it in a bag of rocks and then shook it. The screen is damaged and has a \"dark spot\" on it about a inch in diameter. The laptop is also missing several screws and the case has bad yellowing on it. It gets even worse, if you go into system preferences and look at the system info the laptop serial number is different from the serial number on the bottom of the where the batter goes. Which means this laptop was has been rebuilt out of scrap parts. Do not buy from this seller, the product they sold me was not even close to what was described.", "Date": "October 11, 2011"}, {"Title": "reliable computer", "Author": "pxb2976", "ReviewID": "RW4GLUUMLN370", "Overall": "5.0", "Content": "I've never owned a Mac, but have always wanted to without having to empty my pockets. For a reasonable price I was about to buy one. The operating system is incomparable to that of a PC. It's almost impossible to get a virus on a Mac. I wouldn't buy anything else.", "Date": "August 10, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core 2 Duo Processor 2.16GHz\n1GB DDR2 RAM\n120GB 5400RPM Hard Drive\n13.3-Inch Screen, GMA\nMac OS X", "Name": "Apple MacBook MB062B/A 13.3-Inch Laptop (OLD VERSION)", "ImgURL": "http://ecx.images-amazon.com/images/I/31jEZTXVy7L._SY300_.jpg", "ProductID": "B000QW6ES4"}}